XiaoyaoLinghao/stm32-toolkit/tools/stm32-toolkit/tests/fixtures/svd/STM32F429-exact.svd
<?xml version="1.0" encoding="utf-8"?>
<device schemaVersion="1.3">
  <name>STM32F429ZITx</name>
  <peripherals>
    <peripheral>
      <name>GPIOA</name>
      <baseAddress>0x40020000</baseAddress>
      <size>32</size>
      <access>read-write</access>
      <resetValue>0x00000000</resetValue>
      <resetMask>0xffffffff</resetMask>
      <registers>
        <register>
          <name>IDR</name><addressOffset>0x10</addressOffset><size>32</size>
          <access>read-only</access>
          <fields>
            <field><name>PIN0</name><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>PIN1</name><lsb>1</lsb><msb>1</msb></field>
          </fields>
        </register>
        <register>
          <name>EVENT</name><addressOffset>0x14</addressOffset><size>32</size>
          <access>read-only</access><readAction>clear</readAction>
        </register>
        <register>
          <name>COMMAND</name><addressOffset>0x18</addressOffset><size>32</size>
          <access>write-only</access>
        </register>
        <register derivedFrom="IDR">
          <name>IDR_COPY</name><addressOffset>0x1c</addressOffset>
        </register>
        <cluster>
          <name>CHANNEL%s</name><addressOffset>0x100</addressOffset>
          <dim>2</dim><dimIncrement>0x20</dimIncrement><dimIndex>0,1</dimIndex>
          <register>
            <name>VALUE</name><addressOffset>0x0</addressOffset><size>16</size>
            <access>read-only</access><resetMask>0xffff</resetMask>
          </register>
        </cluster>
      </registers>
    </peripheral>
  </peripherals>
</device>
